In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

# 形の違うデータの計算

In [2]:
ser1 = Series([0, 1, 2], index=['A', 'B', 'C'])

In [3]:
ser1

A    0
B    1
C    2
dtype: int64

In [4]:
ser2 = Series([3, 4, 5, 6], index=['A', 'B', 'C', 'D'])

In [5]:
ser2

A    3
B    4
C    5
D    6
dtype: int64

In [6]:
ser1 + ser2

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [7]:
df1 = DataFrame(np.arange(4).reshape((2, 2)), columns=list('AB'), index=['NY', 'LA'])

In [8]:
df1

    A  B
NY  0  1
LA  2  3

In [11]:
df2 = DataFrame(np.arange(9).reshape((3, 3)), columns=list('ADC'), index=['NY', 'SF', 'LA'])

In [12]:
df2

    A  D  C
NY  0  1  2
SF  3  4  5
LA  6  7  8

In [13]:
df1 + df2

      A   B   C   D
LA  8.0 NaN NaN NaN
NY  0.0 NaN NaN NaN
SF  NaN NaN NaN NaN

In [14]:
df1.add(df2, fill_value=0)

      A    B    C    D
LA  8.0  3.0  8.0  7.0
NY  0.0  1.0  2.0  1.0
SF  3.0  NaN  5.0  4.0

In [15]:
df2

    A  D  C
NY  0  1  2
SF  3  4  5
LA  6  7  8

In [17]:
ser3 = df2.iloc[0]

In [18]:
ser3

A    0
D    1
C    2
Name: NY, dtype: int64

In [19]:
df2 - ser3

    A  D  C
NY  0  0  0
SF  3  3  3
LA  6  6  6

# データの並べ替えと順番

In [31]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [32]:
ser1 = Series(range(3), index=['C', 'A', 'B'])

In [33]:
ser1

C    0
A    1
B    2
dtype: int64

In [34]:
ser1.sort_index()

A    1
B    2
C    0
dtype: int64

In [35]:
ser1

C    0
A    1
B    2
dtype: int64

In [36]:
from numpy.random import randn

In [37]:
ser2 = Series(randn(10))

In [38]:
ser2

0   -0.210967
1   -0.284728
2   -1.456951
3   -1.911833
4    1.892703
5   -0.431785
6   -0.649372
7    1.719287
8   -0.610569
9    0.264762
dtype: float64

In [39]:
ser2.rank()

0     7.0
1     6.0
2     2.0
3     1.0
4    10.0
5     5.0
6     3.0
7     9.0
8     4.0
9     8.0
dtype: float64

In [42]:
ser2.sort_values(ascending=False)

4    1.892703
7    1.719287
9    0.264762
0   -0.210967
1   -0.284728
5   -0.431785
8   -0.610569
6   -0.649372
2   -1.456951
3   -1.911833
dtype: float64

In [44]:
sorted_df2 = ser2.sort_values(ascending=False)

In [45]:
sorted_df2

4    1.892703
7    1.719287
9    0.264762
0   -0.210967
1   -0.284728
5   -0.431785
8   -0.610569
6   -0.649372
2   -1.456951
3   -1.911833
dtype: float64

In [46]:
sorted_df2.rank()

4    10.0
7     9.0
9     8.0
0     7.0
1     6.0
5     5.0
8     4.0
6     3.0
2     2.0
3     1.0
dtype: float64

# データの統計量

In [47]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [48]:
arr = np.array([[1, 2, np.nan], [np.nan, 3, 4]])

In [49]:
arr

array([[  1.,   2.,  nan],
       [ nan,   3.,   4.]])

In [50]:
df1 = DataFrame(arr, index=['A', 'B'], columns=['One', 'Two', 'Three'])

In [51]:
df1

   One  Two  Three
A  1.0  2.0    NaN
B  NaN  3.0    4.0

In [52]:
df1.sum()

One      1.0
Two      5.0
Three    4.0
dtype: float64

In [53]:
df1.sum(axis=1)

A    3.0
B    7.0
dtype: float64

In [54]:
df1.min()

One      1.0
Two      2.0
Three    4.0
dtype: float64

In [55]:
df1.idxmin()

One      A
Two      A
Three    B
dtype: object

In [56]:
df1.max()

One      1.0
Two      3.0
Three    4.0
dtype: float64

In [57]:
df1

   One  Two  Three
A  1.0  2.0    NaN
B  NaN  3.0    4.0

## 累積を求める

In [58]:
df1.cumsum()

   One  Two  Three
A  1.0  2.0    NaN
B  NaN  5.0    4.0

In [59]:
df1.describe()

       One       Two  Three
count  1.0  2.000000    1.0
mean   1.0  2.500000    4.0
std    NaN  0.707107    NaN
min    1.0  2.000000    4.0
25%    1.0  2.250000    4.0
50%    1.0  2.500000    4.0
75%    1.0  2.750000    4.0
max    1.0  3.000000    4.0

In [74]:
import pandas_datareader.data as web
import datetime
import matplotlib.pyplot as plt
start = datetime.datetime(2010, 1, 1)
end = datetime.datetime(2013, 1, 1)

prices = web.DataReader(['CVX','XOM','BP'],'morningstar', start, end).unstack(0)['Close']

NotImplementedError: data_source='morningstar' is not implemented